# 本文档存储器以字编址
# 本文档存储器以字编址
# 本文档存储器以字编址
# 初始PC = 0x00000000

	j _start	# 0

.data
    .word 0,6,0,8,0x80000000,0x80000100,0x100,5,0,0,0   #编译成机器码时，编译器会在前面多加个0，所以后面lw指令地址会多加4

_start:    
		addi $t0,$0,3       	#t0=3  	44
        addi $t1,$0,5   		#t1=5	48
		addi $t2,$0,1       	#t2=1	52
		addi $t3,$0,0			#t3=0	56

        add  $s0,$t1,$t0  		#s0=t1+t0=8  测试add指令	60
        lw   $s1,12($0)  		#							64
        beq  $s1,$s0,_next1		#正确跳到_next 				68
		
		j _fail					

_next1:	
		lw $t0, 16($0)			#t0 = 0x80000000	76
		lw $t1, 20($0)			#t1 = 0x80000100	80
		
		add  $s0,$t1,$t0		#s0 = 0x00000100 = 256	84
		lw $s1, 24($0)			#						88
        beq  $s1,$s0,_next2		#正确跳到_success		92
		
		j _fail

_next2:
		add $0, $0, $t2			#$0应该一直为0			100
		beq $0,$t3,_success		#						104
		
		
_fail:  
		sw   $t3,8($0) #失败通过看存储器地址0x08里值，若为0则测试不通过，最初地址0x08里值为0 108
        j    _fail

_success: 
		sw   $t2,8($0)    #全部测试通过，存储器地址0x08里值为1	116
		j   _success       

					  #判断测试通过的条件是最后存储器地址0x08里值为1，说明全部通过测试